[
  {
    "turn": 1,
    "timestamp": "2024-11-07T23:28:07.477310",
    "student": "\"Doctor, ji... I don't know where to start. We talked last week about my anxiety and family expectations, but things seem to be getting worse. Campus placements are just a month away, and my mind is constantly racing with thoughts of not getting a good job. Meri Mummy kehte hain, 'Rohan, beta, thoda mehnat kar aur sab theek ho jayega,' par maine mehnat ki hi hai, sir. (My mom says, 'Rohan, son, just work hard and everything will be alright,' but I have been working hard, sir.) I feel like I'm falling behind my friends. They all seem so confident and prepared for placements. Aur main? Main",
    "sukoon": "It sounds like you're struggling with some difficult thoughts, and that's okay. What’s one negative thought that’s been bothering you recently? Identifying it can help us challenge and reframe it into something more positive. Remember, you're not alone in this journey.",
    "agent_type": "unknown",
    "conversation_id": "20241107_232802"
  },
  {
    "turn": 2,
    "timestamp": "2024-11-07T23:28:11.079274",
    "student": "\"Sir, actually, there are many negative thoughts, but one thing that's really bothering me is: 'Agar main campus placement mein nahi chun gaya toh kya main fail ho gaya?' (If I don't get selected in campus placement, does it mean I'm a failure?) I keep thinking about what my family and friends will think. They all have such high expectations from me. I know you said we can reframe these thoughts, but how do I do that, sir? It's hard to change the way I think when I've been thinking this way for so long. Aur ab to thoda tension bhi hai kyunki placements ke liye prepare toh karta hoon, lekin kuch",
    "sukoon": "It sounds like you're dealing with a lot of pressure, and that's completely normal. Let's reframe: Not getting a placement doesn't define your worth or success. What are some skills or achievements you're proud of that can help you build confidence for the future?",
    "agent_type": "unknown",
    "conversation_id": "20241107_232802"
  },
  {
    "turn": 3,
    "timestamp": "2024-11-07T23:28:14.758748",
    "student": "\"Sir, I've been thinking about that a lot since our last conversation. You're right, not getting a placement doesn't define my worth. I've made a list of my skills, like problem-solving and programming, and I've achieved good grades in some of my subjects. But, it's hard to shake off the feeling of failure when I see my friends getting job offers from top companies. Kya agar maine thoda zyada mehnat ki hoti toh sach mein kuch aur behtar milta? (Would I have done better if I'd worked even harder?)\n\nAnd there's another thing that's been bothering me. My parents keep comparing me to my cousins who've already secured good jobs. They say,",
    "sukoon": "It sounds like you're feeling pressured by comparisons, and that's understandable. Remember, everyone's journey is unique. Focus on your skills and achievements. Ask yourself: \"How can I use what I have learned to find opportunities that suit me best?\" Progress is personal, not comparative.",
    "agent_type": "unknown",
    "conversation_id": "20241107_232802"
  },
  {
    "turn": 4,
    "timestamp": "2024-11-07T23:28:18.418801",
    "student": "\"Sir, I understand what you're saying, but yeh sab bohot mushkil lag raha hai (it all feels very difficult). My parents keep asking me, 'Rohan, tumhare friends ko toh job mil gayi, tumhe kya problem hai?' (Rohan, your friends have gotten jobs, what's your problem?). They don't understand that everyone's situation is different. I feel like I'm stuck between their expectations and my own anxiety. Main kabhi socha nahi tha ki placements ke liye itna stress hoga (I never thought I'd be so stressed about placements). Can we talk more about how to deal with these comparisons and the pressure from my family?\"",
    "sukoon": "It sounds like you're feeling overwhelmed by comparisons and expectations. That's understandable. Let's focus on managing this pressure. How can you communicate your unique journey to your parents? Maybe share your skills list with them. How does that sound?",
    "agent_type": "unknown",
    "conversation_id": "20241107_232802"
  },
  {
    "turn": 5,
    "timestamp": "2024-11-07T23:28:36.668966",
    "student": "\"Sir, I actually shared my skills list with my parents, but they still keep comparing me to my cousins. They say, 'Beta, Rohan, tumhare cousins ne itni mehnat ki thi, tum bhi karo (Son, your cousins worked hard too, you should also do it).' I feel like they're not listening to me. They're just focused on the end result, not on how I'm feeling or what I've achieved so far.\n\nI also tried to explain to them that everyone's journey is different, but they just say, 'Tum bhi chale jao, tumhare friends chal gaye (You also go, your friends have gone).' It's like they're not understanding",
    "sukoon": "It sounds like you're feeling unheard, and that's frustrating. Acknowledge their concerns, but remind yourself that your journey is yours alone. How about setting small, achievable goals for yourself to build confidence? This might help shift focus from comparisons to personal growth. What do you think?",
    "agent_type": "unknown",
    "conversation_id": "20241107_232802"
  }
]